[net]
# Testing
# batch=1
# subdivisions=1
# Training
batch=256
subdivisions=16
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=30
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 100000
policy=steps
steps=70000,80000,90000
scales=.1,.1,.1

#1
[convolutional] 
batch_normalize=1
filters=9
size=3
stride=1
pad=1
activation=leaky

# Downsample

#2

[convolutional]  
batch_normalize=1
filters=15 
size=3
stride=2
pad=1
activation=leaky

#3
[convolutional]
batch_normalize=1
filters=9 
size=1
stride=1
pad=1
activation=leaky

#4
[convolutional] 
batch_normalize=1
filters=15 
size=3
stride=1
pad=1
activation=leaky
#1
[shortcut]
from=-3
activation=linear





# Downsample

#5

[convolutional] 
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

#6
[convolutional]
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#7
[convolutional] 
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky
#2
[shortcut]
from=-3
activation=linear




#8

[convolutional] 
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#9
[convolutional] 
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky
#3
[shortcut]
from=-3
activation=linear

# Downsample
#10

[convolutional] 
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

#11

[convolutional] 
batch_normalize=1
filters=16  
size=1
stride=1
pad=1
activation=leaky

#12

[convolutional]
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#4
[shortcut]
from=-3
activation=linear

#13

[convolutional]
batch_normalize=1
filters=12 
size=1
stride=1
pad=1
activation=leaky

#14

[convolutional] 
batch_normalize=1
filters=16  
size=3
stride=1
pad=1
activation=leaky

#5
[shortcut]
from=-3
activation=linear

#15

[convolutional] 
batch_normalize=1
filters=8  
size=1
stride=1
pad=1
activation=leaky

#16

[convolutional] 
batch_normalize=1
filters=16  
size=3
stride=1
pad=1
activation=leaky

#6
[shortcut]
from=-3
activation=linear

#17

[convolutional] 
batch_normalize=1
filters=8   
size=1
stride=1
pad=1
activation=leaky

#18

[convolutional]
batch_normalize=1
filters=16  
size=3
stride=1
pad=1
activation=leaky

#7
[shortcut]
from=-3
activation=linear

#19

[convolutional]
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#20

[convolutional]
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#8
[shortcut]
from=-6
activation=linear

#21

[convolutional] 
batch_normalize=1
filters=8  
size=1
stride=1
pad=1
activation=leaky

#22

[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#9
[shortcut]
from=-3
activation=linear

#23

[convolutional] 
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#24

[convolutional]
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#10
[shortcut]
from=-3
activation=linear

#25

[convolutional] 
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#26

[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#11
[shortcut]
from=-3
activation=linear

# Downsample
#27

[convolutional] 
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

#28

[convolutional] 
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#29
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

#12
[shortcut]
from=-3
activation=linear

#30

[convolutional] 
batch_normalize=1
filters=8
size=1
stride=1
pad=1
activation=leaky

#31

[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#13
[shortcut]
from=-3
activation=linear

#32
[convolutional] 
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#33
[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#14
[shortcut]
from=-3
activation=linear

#34
[convolutional] 
batch_normalize=1
filters=8
size=1
stride=1
pad=1
activation=leaky

#35
[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#15
[shortcut]
from=-3
activation=linear

#36
[convolutional] 
batch_normalize=1
filters=8
size=1
stride=1
pad=1
activation=leaky

#37
[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#16
[shortcut]
from=-3
activation=linear

#38
[convolutional] 
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#39
[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#17
[shortcut]
from=-3
activation=linear

#40
[convolutional] 
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#41
[convolutional] 
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#18
[shortcut]
from=-3
activation=linear

#42

[convolutional] 
batch_normalize=1
filters=8 
size=1
stride=1
pad=1
activation=leaky

#43
[convolutional]
batch_normalize=1
filters=16 
size=3
stride=1
pad=1
activation=leaky

#19
[shortcut]
from=-3
activation=linear

# Downsample
#44

[convolutional] 
batch_normalize=1
filters=32 
size=3
stride=2
pad=1
activation=leaky

#45

[convolutional] 
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#46

[convolutional] 
batch_normalize=1
filters=32 
size=3
stride=1
pad=1
activation=leaky

#20
[shortcut]
from=-3
activation=linear

#47
[convolutional] 
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#48
[convolutional] 
batch_normalize=1
filters=32 
size=3
stride=1
pad=1
activation=leaky

#21
[shortcut]
from=-6
activation=linear

#49
[convolutional] 
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#50
[convolutional] 
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

#22
[shortcut]
from=-3
activation=linear

#51
[convolutional]
batch_normalize=1
filters=16 
size=1
stride=1
pad=1
activation=leaky

#52
[convolutional] 
batch_normalize=1
filters=32 
size=3
stride=1
pad=1
activation=leaky

#23
[shortcut]
from=-3
activation=linear

######################
#53
[convolutional] 
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

#54
[convolutional] 
batch_normalize=1
size=3
stride=1
pad=1
filters=32 
activation=leaky

#55
[convolutional] 
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

#56

[convolutional] 
batch_normalize=1
filters=32
size=3
stride=1
pad=1 
activation=leaky

#57

[convolutional] 
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

#58

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=32 
activation=leaky

#59
[convolutional] 
size=1
stride=1
pad=1
filters=30
activation=linear

[yolo]
mask = 6,7,8
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=5
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=1

[route]
layers = -4

#60

[convolutional] 
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 61


#61
[convolutional] 
batch_normalize=1
filters=48
size=1
stride=1
pad=1
activation=leaky

#62

[convolutional] 
batch_normalize=1
filters=56
size=3
stride=1
pad=1
activation=leaky

#63

[convolutional] 
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

#64

[convolutional] 
batch_normalize=1
filters=72
size=3
stride=1
pad=1
activation=leaky

#65

[convolutional] 
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=leaky

#66

[convolutional] 
batch_normalize=1
size=3
stride=1
pad=1
filters=112
activation=leaky

#67

[convolutional]
size=1
stride=1
pad=1
filters=30
activation=linear

[yolo]
mask = 3,4,5
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=5
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=1

[route]
layers = -4

#68

[convolutional] 
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 36


#69
[convolutional] 
batch_normalize=1
filters=72
size=3
stride=1
pad=1
activation=leaky

#70
[convolutional] 
batch_normalize=1
size=3
stride=1
pad=1
filters=144
activation=leaky



#71
[convolutional] 
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

#72
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

#73
[convolutional] 
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

#74
[convolutional] 
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

#75
[convolutional] 
size=1
stride=1
pad=1
filters=30
activation=linear

[yolo]
mask = 0,1,2
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=5
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=1




